#### OrdinateOriginVisibility Enumeration

---

|  |
| --- |
| See Also |

The ordinate origin visibility.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public enum OrdinateOriginVisibility ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration OrdinateOriginVisibility ``` |

| Visual C++ |
| --- |
| ``` public enum class OrdinateOriginVisibility ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Does not show the origin witness line, tick mark, or text (0'-0"). |
| WitnessLineWithText | Shows the origin witness line, tick mark and text (0'-0"). |
| WitnessLineOnly | Shows the origin witness line and tick mark. |

# See Also

Autodesk.Revit.DB Namespace